<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 3 changes.</summary>

```diff
! module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
+ module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 2 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-08T17:47:27Z [(view log)](https://github.com/perchnet/p/actions/runs/16836978013/job/47698727596#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-08T17:32:32Z" -> (known after apply)
        id                      = "9013"
        name                    = "debian13"
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-08T17:32:32Z" -> (known after apply)
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm-ubuntu22-minimal"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = false
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 10000

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 8022
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "zssd"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + dns {
              + servers = []
            }

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                ]
            }
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->